[
  {
    "text": "LOVE her new space! So warm and inviting! She has a great big window with all the natural lighting! It’s wonderful to check out your new do! I am so happy I found Ricki and I’m always so happy EVERYTIME she does a cut or color! She always understands what I want and executes it!",
    "date": "06.27.2025",
    "name": "Anonymous",
    "stars": 5
  },
  {
    "text": "RicQuell is the most knowledgeable hairstylist I've ever encountered. Her technique is flawless. She truly sends you out with \"hot girl hair\".",
    "date": "05.10.2025",
    "name": "Brandi",
    "stars": 5
  },
  {
    "text": "I love the way she listens to exactly what I want. My hair has never looked better!",
    "date": "05.09.2025",
    "name": "Dawn Thieman",
    "stars": 5
  },
  {
    "text": "My haircut experience was lovely and RicQuell was so awesome! I had a specific cut in mind and it turned out amazing!",
    "date": "05.03.2025",
    "name": "Allison Frederick",
    "stars": 5
  },
  {
    "text": "RicQuell was amazing! So kind and thoughtful—she explained options for my cut based on my lifestyle and daily time to style which was so helpful! I loved my cut as much as I loved chatting with her! 10/10 for sure!! :)",
    "date": "04.02.2025",
    "name": "Jessica Y.",
    "stars": 5
  },
  {
    "text": "Amazing! Wonderful job, just what I wanted! Thank you!",
    "date": "03.19.2025",
    "name": "Tracy M",
    "stars": 5
  },
  {
    "text": "She did an amazing job! Spent time explaining the process to me and stayed extra late to accommodate my schedule.",
    "date": "02.25.2025",
    "name": "Erin Lakin",
    "stars": 5
  },
  {
    "text": "She is the hair fairy✨ she completely transformed my hair! It’s a beautiful natural melt with gorgeous highlights and blonde face framing! I truly feel like I could be one of those “ Pinterest perfect girlies!” I am so grateful!!! It looks gorgeous! Every time I walk past a mirror I have to check it out! She styled it perfectly too!!! 💯",
    "date": "02.10.2025",
    "name": "Anonymous",
    "stars": 5
  },
  {
    "text": "Wow!!! 5 ⭐️!!! I am in love with my cut and color! My hair feels great and freshened up! Such a great day spent with great people! Can’t wait for my next appointment!",
    "date": "02.06.2025",
    "name": "Kim",
    "stars": 5
  },
  {
    "text": "I got a referral to use RicQuell, I messaged her, and within hours we briefly talked about what I wanted! She suggested a free consultation to come in and go over cut, color , and pricing! She was so thorough and knowledgeable. She was very professional and super friendly! She told me her service prices so there would be no surprises at the end of any appointments! I book that day for the end of the week! I am very excited to start a relationship with her!",
    "date": "02.03.2025",
    "name": "Kimmi Berardino",
    "stars": 5
  },
  {
    "text": "This was my first appointment with RicQuell and I will definitely be back!! RicQuell was extremely attentive, listened to my likes and dislikes, and recommended color and styling that would work best for my lifestyle! She explained in detail why she made each recommendation and provided lots of information on how to make my color and style last! I ended up doing a big chop and custom color and couldn’t be happier! My hair feels lighter and I am in love with the color! If you are looking for a hairstylist who is there for you and listens, I can’t recommend her enough!!",
    "date": "02.02.2025",
    "name": "Monica McPherson",
    "stars": 5
  },
  {
    "text": "RicQuell is the best hair stylist I’ve ever had the pleasure of having! She’s amazing to talk to and pays so much attention to detail! I’d recommend her 10 times over!!",
    "date": "01.21.2025",
    "name": "Skylynn M.",
    "stars": 5
  },
  {
    "text": "My experience with Ricquell was amazing , she took the time to listent to my needs and concerns, and the final result of my highlights were amazing. :-)",
    "date": "11.29.2024",
    "name": "Alexandra Banderas",
    "stars": 5
  },
  {
    "text": "RicQuell is phenomenal. All of the things I could not achieve with my last stylist, she has been able to do easily. Not to mention she’s sweet as can be. 10/10 recommend!",
    "date": "11.26.2024",
    "name": "Krystle Swing",
    "stars": 5
  },
  {
    "text": "She got me in same and totally redid my look. I absolutely love it. She talked to me the whole time and even made an adjustment towards the end to pull the back up more. I went for a more drastic change and everyone there were very very nice and supportive. Will definitely go back!",
    "date": "11.19.2024",
    "name": "Elise",
    "stars": 5
  },
  {
    "text": "I have struggled to find someone to cut my hair so that I LOVE it! Today was the best haircut I have had in over 10 years and I am beyond excited to have found RicQuell!",
    "date": "11.05.2024",
    "name": "Ashley",
    "stars": 5
  },
  {
    "text": "RicQuell does a wonderful job with my hair. She listens to what I want, she makes suggestions and has even given me tips and links to styling products for healthy hair. I highly recommend RicQuell for your hair styling needs!",
    "date": "09.06.2024",
    "name": "Amy",
    "stars": 5
  },
  {
    "text": "Another amazing hair transformation! I am so happy I found RicQuell she always does an amazing job.",
    "date": "08.21.2024",
    "name": "Jess",
    "stars": 5
  },
  {
    "text": "RicQuell does such a great job with my hair. She listens intently and offers suggestions to assist your needs. And a super kind, fun person to hang out with during a treatment.",
    "date": "08.20.2024",
    "name": "Jen",
    "stars": 5
  },
  {
    "text": "Love RicQuell! Great haircut and conversation <3",
    "date": "08.07.2024",
    "name": "Jody Hackemer",
    "stars": 5
  },
  {
    "text": "RicQuell is the absolute BEST! Her work is perfection, but she’s also incredibly kind, welcoming, and fun to talk with during services. My hair has never looked better since I started booking with her!",
    "date": "08.01.2024",
    "name": "Suzanne",
    "stars": 5
  },
  {
    "text": "I always love getting my hair done by RicQuell and this time was no different! She does amazing work",
    "date": "05.09.2023",
    "name": "Natalie",
    "stars": 5
  },
  {
    "text": "Had a blast rockin out to Disney music today! Your amazing and always do the best job!!",
    "date": "04.28.2023",
    "name": "Kelsey G",
    "stars": 5
  },
  {
    "text": "My hair looks and feels incredible!",
    "date": "03.14.2023",
    "name": "Correy brown",
    "stars": 5
  },
  {
    "text": "I was chosen as a color block model and ricquell did more than amazing on my hair , I hadn't gotten done by a professional in 5/6 years but would def come to ricquell again in a heart beat so happy with how everything turned out",
    "date": "03.13.2023",
    "name": "Mackenzie k",
    "stars": 5
  },
  {
    "text": "Ricquell has always been so amazing with me! She listens to my hair needs and always takes the time to talk it through before starting. She’s very honest which I love and she always makes sure I’m happy when we are done! <3 will definitely continue going to her for years!!!",
    "date": "02.10.2023",
    "name": "Tania Saba",
    "stars": 5
  },
  {
    "text": "Ricquell is the best!!! My daughter and I both see her and we always leave super happy!",
    "date": "12.30.2022",
    "name": "Ally",
    "stars": 5
  },
  {
    "text": "Absolutely love my hair! I will definitely be back.",
    "date": "12.29.2022",
    "name": "Tina Kennedy",
    "stars": 5
  },
  {
    "text": "RicQuell really takes her time with my hair and does a fantastic job. I was so nervous to trust someone with my hair but she immediately put me at ease. We went through a consultation and came up with plan. It’s been 2 years now and I’m so glad to have her. She’s so much more than just a haircut to me. I feel 100% confident that I’m going to walk out of there looking my best and it means so much to me. ❤️",
    "date": "12.15.2022",
    "name": "Lisa",
    "stars": 5
  },
  {
    "text": "Very professional with attention to detail.",
    "date": "12.02.2022",
    "name": "Tatum Fusco",
    "stars": 5
  },
  {
    "text": "Absolutely love coming to RicQuell to get my hair done. She does an AMAZING job!!",
    "date": "09.16.2022",
    "name": "Lisa",
    "stars": 5
  },
  {
    "text": "The best! She was able to get me in quickly and touched up my hair so nice! Luckily my kids were able to tag along this time.",
    "date": "09.07.2022",
    "name": "Kiley Shaw",
    "stars": 5
  },
  {
    "text": "Professional and listened to my concerns. I will be returning with my daughters.",
    "date": "07.13.2022",
    "name": "Christina",
    "stars": 5
  },
  {
    "text": "I have been going to Ricquell for many years now and she always does the best job! She is so sweet and treats her clients so well.",
    "date": "07.08.2022",
    "name": "Lisa",
    "stars": 5
  },
  {
    "text": "Ricquell does amazing work! She is so personable and the only hairdresser I trust with my hair! I get exactly the haircut I asked for!",
    "date": "06.30.2022",
    "name": "Regan Large",
    "stars": 5
  },
  {
    "text": "Ricquell does amazing work! She is so personable and the only hairdresser I trust with my hair! I get exactly the haircut I asked for!",
    "date": "06.17.2022",
    "name": "Lauren",
    "stars": 5
  },
  {
    "text": "I live in Oklahoma, and every time I come to Grapevine I schedule a hair cut with RicQuell. She always does an excellent job!",
    "date": "06.07.2022",
    "name": "Kathy",
    "stars": 5
  },
  {
    "text": "Absolutely love my hair ! Love how you take the time to listen to what I want and how perfection you are in your work and the passion you have into it as well ❤️",
    "date": "06.01.2022",
    "name": "Bree",
    "stars": 5
  },
  {
    "text": "Awesome experience",
    "date": "05.26.2022",
    "name": "Lisa",
    "stars": 5
  },
  {
    "text": "Riquel is so talented and sweet! Always love coming to see her! :)",
    "date": "04.18.2022",
    "name": "Alison H",
    "stars": 5
  },
  {
    "text": "My favorite stylist ever. LOVE MY HAIR SO MUCH!!!",
    "date": "04.12.2022",
    "name": "Shelby",
    "stars": 5
  }
]
